# %%bqsql cell magics

The BigQuery DataFrames (aka BigFrames) package provides a `%%bqsql` cell magics for Jupyter environments.

To use it, first activate the extension:

In [1]:
%load_ext bigframes

Now, use the magics by including SQL in the body.

In [2]:
%%bqsql
SELECT * FROM `bigquery-public-data.usa_names.usa_1910_2013`

state gender  year    name  number
   HI      F  1999  Ariana      10
   HI      F  2002  Jordyn      10
   HI      F  2006     Mya      10
   HI      F  2010  Jordyn      10
   HI      M  1921   Nobuo      10
   HI      M  1925   Ralph      10
   HI      M  1926   Hisao      10
   HI      M  1927   Moses      10
   HI      M  1933   Larry      10
   HI      M  1933 Alfredo      10
...

[5552452 rows x 5 columns]

The output DataFrame can be saved to a variable.

In [3]:
%%bqsql mydf
SELECT * FROM `bigquery-public-data.usa_names.usa_1910_2013`

You can chain cells together using format strings. DataFrame objects are automatically turned into table expressions.

In [4]:
%%bqsql
SELECT sum(number) as total_count, name
FROM {mydf}
WHERE name LIKE 'Tr%'
GROUP BY name
ORDER BY total_count DESC

   total_count     name
0       304036    Tracy
1       293876   Travis
2       203784     Troy
3       150127   Trevor
4        96397  Tristan
5        89996   Tracey
6        65546  Trinity
7        50112    Traci
8        49657  Trenton
9        45692    Trent
...

[238 rows x 2 columns]